PAAAAANDASSSSS

In [3]:
import pandas as pd

In [3]:
pd.__version__

'1.5.3'

introduction to Series

    . series is 1d

In [5]:
vowel=['a' , 'e' , 'i' ,'o','u']
s=pd.Series(vowel)
s

0    a
1    e
2    i
3    o
4    u
dtype: object

In [6]:
type(s)

pandas.core.series.Series

In [7]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
list(s.index)

[0, 1, 2, 3, 4]

In [9]:
s.values

array(['a', 'e', 'i', 'o', 'u'], dtype=object)

In [10]:
s[3]

'o'

In [11]:
s.values[3]

'o'

In [12]:
vowel=['a' , 'e' , 'i' ,'o','u']
s=pd.Series(vowel, index=range(101,106))
s

101    a
102    e
103    i
104    o
105    u
dtype: object

In [13]:
s[104]

'o'

In [16]:
s.values[4]

'u'

In [4]:
s=pd.Series(['Ram','Sunil','Manish' , 'Bishawash' , 'Sulav'] , name="student_name")
s

0          Ram
1        Sunil
2       Manish
3    Bishawash
4        Sulav
Name: student_name, dtype: object

In [5]:
s1=pd.Series(['Ram','Sunil','Manish' , 'Bishawash' , 'Sulav'] , name="student_name")
s2=pd.Series([1,2,4,5,3] , name="sem")

In [6]:
df=pd.concat([s1,s2], axis='columns')
df

  student_name  sem
0          Ram    1
1        Sunil    2
2       Manish    4
3    Bishawash    5
4        Sulav    3

In [8]:
df=pd.read_csv("penguins.csv")
df

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [9]:
df.shape

(344, 7)

In [11]:
df.columns.to_list()

['species',
 'island',
 'bill_length_mm',
 'bill_depth_mm',
 'flipper_length_mm',
 'body_mass_g',
 'sex']

In [12]:
df.head() #first five rows preview

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [13]:
df.tail() #last five rows

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [14]:
df.sample(3)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
253,Gentoo,Biscoe,59.6,17.0,230.0,6050.0,MALE
180,Chinstrap,Dream,46.4,17.8,191.0,3700.0,FEMALE
211,Chinstrap,Dream,45.6,19.4,194.0,3525.0,FEMALE

In [16]:
df.sample(3, random_state=2) #random_state is seed

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
67,Adelie,Biscoe,41.1,19.1,188.0,4100.0,MALE
327,Gentoo,Biscoe,53.4,15.8,219.0,5500.0,MALE
20,Adelie,Biscoe,37.8,18.3,174.0,3400.0,FEMALE

In [18]:
df.describe()

       bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
count      342.000000     342.000000         342.000000   342.000000
mean        43.921930      17.151170         200.915205  4201.754386
std          5.459584       1.974793          14.061714   801.954536
min         32.100000      13.100000         172.000000  2700.000000
25%         39.225000      15.600000         190.000000  3550.000000
50%         44.450000      17.300000         197.000000  4050.000000
75%         48.500000      18.700000         213.000000  4750.000000
max         59.600000      21.500000         231.000000  6300.000000

In [20]:
df.describe(include="object") #describe the non numeric column

       species  island   sex
count      344     344   333
unique       3       3     2
top     Adelie  Biscoe  MALE
freq       152     168   168

In [23]:
df.head(3)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE

In [28]:
df['species']

0      Adelie
1      Adelie
2      Adelie
3      Adelie
4      Adelie
        ...
339    Gentoo
340    Gentoo
341    Gentoo
342    Gentoo
343    Gentoo
Name: species, Length: 344, dtype: object

In [33]:
df['species'].unique()

array(['Adelie', 'Chinstrap', 'Gentoo'], dtype=object)

In [35]:
df['species'].value_counts()

Adelie       152
Gentoo       124
Chinstrap     68
Name: species, dtype: int64

In [36]:
df.island.unique()

array(['Torgersen', 'Biscoe', 'Dream'], dtype=object)

In [37]:
df.island.value_counts()

Biscoe       168
Dream        124
Torgersen     52
Name: island, dtype: int64

In [38]:
df.sort_values(by='body_mass_g')

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
190,Chinstrap,Dream,46.9,16.6,192.0,2700.0,FEMALE
64,Adelie,Biscoe,36.4,17.1,184.0,2850.0,FEMALE
58,Adelie,Biscoe,36.5,16.6,181.0,2850.0,FEMALE
116,Adelie,Torgersen,38.6,17.0,188.0,2900.0,FEMALE
98,Adelie,Dream,33.1,16.1,178.0,2900.0,FEMALE
...,...,...,...,...,...,...,...
337,Gentoo,Biscoe,48.8,16.2,222.0,6000.0,MALE
253,Gentoo,Biscoe,59.6,17.0,230.0,6050.0,MALE
237,Gentoo,Biscoe,49.2,15.2,221.0,6300.0,MALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN

In [41]:
df.sort_values(by='body_mass_g' , ascending=False)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
237,Gentoo,Biscoe,49.2,15.2,221.0,6300.0,MALE
253,Gentoo,Biscoe,59.6,17.0,230.0,6050.0,MALE
297,Gentoo,Biscoe,51.1,16.3,220.0,6000.0,MALE
337,Gentoo,Biscoe,48.8,16.2,222.0,6000.0,MALE
331,Gentoo,Biscoe,49.8,15.9,229.0,5950.0,MALE
...,...,...,...,...,...,...,...
58,Adelie,Biscoe,36.5,16.6,181.0,2850.0,FEMALE
64,Adelie,Biscoe,36.4,17.1,184.0,2850.0,FEMALE
190,Chinstrap,Dream,46.9,16.6,192.0,2700.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN

In [42]:
df['sex']=='MALE'

0       True
1      False
2      False
3      False
4      False
       ...
339    False
340    False
341     True
342    False
343     True
Name: sex, Length: 344, dtype: bool

In [46]:
df.loc[df['island']=='Biscoe']

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
20,Adelie,Biscoe,37.8,18.3,174.0,3400.0,FEMALE
21,Adelie,Biscoe,37.7,18.7,180.0,3600.0,MALE
22,Adelie,Biscoe,35.9,19.2,189.0,3800.0,FEMALE
23,Adelie,Biscoe,38.2,18.1,185.0,3950.0,MALE
24,Adelie,Biscoe,38.8,17.2,180.0,3800.0,MALE
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [48]:
df.loc[df.sex=='FEMALE']['body_mass_g'].mean()

3862.2727272727275

In [51]:
df.loc[df.sex=='FEMALE']['flipper_length_mm'].mean()

197.36363636363637

In [52]:
df.loc[df.sex=='MALE']['flipper_length_mm'].mean()

204.50595238095238

In [54]:
df.groupby(['sex'])['flipper_length_mm'].mean()

sex
FEMALE    197.363636
MALE      204.505952
Name: flipper_length_mm, dtype: float64

In [60]:
df.groupby(['sex' , 'species'])['flipper_length_mm'].median()

sex     species
FEMALE  Adelie       188.0
        Chinstrap    192.0
        Gentoo       212.0
MALE    Adelie       193.0
        Chinstrap    200.5
        Gentoo       221.0
Name: flipper_length_mm, dtype: float64

loc vs iloc

In [61]:
df.sample(3)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
171,Chinstrap,Dream,49.2,18.2,195.0,4400.0,MALE
245,Gentoo,Biscoe,46.1,15.1,215.0,5100.0,MALE
117,Adelie,Torgersen,37.3,20.5,199.0,3775.0,MALE

In [63]:
df.loc[25:30, ['species' , 'island']]

   species  island
25  Adelie  Biscoe
26  Adelie  Biscoe
27  Adelie  Biscoe
28  Adelie  Biscoe
29  Adelie  Biscoe
30  Adelie   Dream

In [1]:
df.loc[25:30 , 2:] #invalid

NameError: name 'df' is not defined

#ilco

In [69]:
df.iloc[25:30 , 2:]

    bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g     sex
25            35.3           18.9              187.0       3800.0  FEMALE
26            40.6           18.6              183.0       3550.0    MALE
27            40.5           17.9              187.0       3200.0  FEMALE
28            37.9           18.6              172.0       3150.0  FEMALE
29            40.5           18.9              180.0       3950.0    MALE

In [70]:
df.iloc[25:30, ['species' , 'island']] #invalid requires index

IndexError: .iloc requires numeric indexers, got ['species' 'island']

In [72]:
df.iloc[25:30 , :-2]

   species  island  bill_length_mm  bill_depth_mm  flipper_length_mm
25  Adelie  Biscoe            35.3           18.9              187.0
26  Adelie  Biscoe            40.6           18.6              183.0
27  Adelie  Biscoe            40.5           17.9              187.0
28  Adelie  Biscoe            37.9           18.6              172.0
29  Adelie  Biscoe            40.5           18.9              180.0

In [81]:
df.loc[df.flipper_length_mm>200]['flipper_length_mm']

90     202.0
91     205.0
95     208.0
101    203.0
123    202.0
       ...
338    214.0
340    215.0
341    222.0
342    212.0
343    213.0
Name: flipper_length_mm, Length: 148, dtype: float64